package com.example.educationalgp.Activity;

import androidx.appcompat.app.AppCompatActivity;
import androidx.appcompat.app.AppCompatDelegate;


import android.content.Intent;
import android.os.Bundle;
import android.os.Handler;

import com.example.educationalgp.Model.Question;
import com.example.educationalgp.R;
import com.example.educationalgp.Repository.TeacherRepository;
import com.example.educationalgp.ViewModel.TeacherViewModel;

import java.util.List;


public class MainActivity extends AppCompatActivity {

    public static List<String> teacherIDs;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);

        AppCompatDelegate.setDefaultNightMode(AppCompatDelegate.MODE_NIGHT_NO);



        new Handler().postDelayed(() -> {
            Intent intent = new Intent(MainActivity.this, RoleSelectorActivity.class);
            startActivity(intent);
        },3000);

        Question q1 = new Question(
                "كل مما يأتي من تطبيقات القصور الذاتي عدا............",
                "سقوط لاعب كره على وجهه أثناء عرقله قدمه",
                "حركه المروحة بعد قطع التيار الكهربي",
                "انقباض وانبساط عضله القلب",
                "استخدام المنخفضة عند تنظيف السجاد",
                "انقباض وانبساط عضله القلب"
        );
        Question q2 = new Question(
                "تشحيم وتزيت التروس في الآلات الميكانيكية بغرض........",
                "تقليل الضغط",
                "زياده الضغط",
                "زياده الاحتكاك",
                "تقليل الاحتكاك",
                "تقليل الاحتكاك"
        );Question q3 = new Question(
                "تعرف القوي التي تمكن الكائنات الحية من القيام بالعمليات الحيوية بالقوي...........",
                "القصور الذاتي",
                "الاحتكاك",
                "داخل الأنظمة الحية",
                "الضغط",
                "داخل الأنظمة الحية"
        );Question q4 = new Question(
                "السرعة الفعلية القطار يتحرك بسرعه نسبيه 80 كم / س بالنسبة لراكب سيارة يتحرك في عكس اتجاه القطار بسرعه 45 كم / س هي......... كم/س ",
                "صفر",
                "35",
                "100",
                "125",
                "35"
        );Question q5 = new Question(
                "يصنع الملف في المغناطيس الكهربي من سلك من...........",
                "النحاس",
                "الحديد المطاوع",
                "الألومنيوم",
                "الخارصين",
                "النحاس"
        );Question q6 = new Question(
                "صوب ما بين القوسين: عند مرور التيار الكهربي في ملف المغناطيس يتحول إلى مغناطيس (دائم)",
                "مستمر",
                "ثابت",
                "مؤقت",
                "لا يمكن تحديده",
                "مؤقت"
        );Question q7 = new Question(
                "صوب ما بين القوسين: أجهزة الرؤية الليلية من تطبيقات (الأشعة فوق بنفسجية)",
                "الأشعة تحت حمراء",
                "الأشعة السينية",
                "اشعه جاما",
                "الأشعة المرئية",
                "الأشعة تحت حمراء"
        );Question q8 = new Question(
                "صوب ما بين القوسين: من الآلات الموسيقية الوترية الكمان والعود و(الناي)",
                "الجيتار",
                "الدف",
                "المزمار",
                "الفلوت",
                "الجيتار"
        );Question q9 = new Question(
                "صوب ما بين القوسين: تعمل قوي الاحتكاك في (نفس) اتجاه حركه الجسم",
                "يمين",
                "يسار",
                "عمودي علي",
                "عكس",
                "عكس"
        );Question q10 = new Question(
                " يدين صناع السينما والتلفزيون بالفضل لتطبيقات الضوء المرئي ل...........",
                "لان اشعه الضوء المرئي تستخدم في عرض الصور والأفلام المتحركة بواسطة اجهزه العروض الضوئية",
                "لإنها نستخدم في تصوير سطح الأرض بواسطة الأقمار الصناعية",
                "لا توجد اي إجابه صحيحه",
                "الاجاباتان صحيحتان",
                "لان اشعه الضوء المرئي تستخدم في عرض الصور والأفلام المتحركة بواسطة اجهزه العروض الضوئية"
        );Question q11 = new Question(
                " يوجد داخل الغسالة محرك كهربي............",
                "حتى يقوم بتحويل الطاقة الكهربية لطاقه حرارية",
                "حتى يقوم بتحويل الطاقة الكهربية لطاقه حركيه",
                "حتى يقوم بتحويل الطاقة الحرارية لطاقه حركيه",
                "حتى يقوم بتحويل الطاقة الحركية لطاقه كهربي",
                "حتى يقوم بتحويل الطاقة الحرارية لطاقه حركيه"
        );Question q12 = new Question(
                " ماذا تعني بأن: وزن الجسم يساوي 50 نيوتن.",
                "هذا يعني ان مقدار ما يحتويه الجسم من ماده يساوي 50 نيوتن",
                "هذا يعني ان قوه جذب الأرض للجسم تساوي 50 نيوتن",
                "هذا يعني ان الحيز الذي يشغله الجسم من الفراغ يساوي 50 نيوتن",
                "هذا يعني ان كتله الجسم تساوي 50 نيوتن",
                "هذا يعني ان قوه جذب الأرض للجسم تساوي 50 نيوتن"
        );Question q13 = new Question(
                "إذا كانت سرعه السيارة 80 كم/س فإن سرعه راكب السيارة تكون........كم/س",
                "صفر",
                "80",
                "أكبر من 80",
                "اقل من 80",
                "80"
        );Question q14 = new Question(
                "يتحرك قطاران في اتجاهين متضادين على شريطين متوازيين فاذا كانت سرعه القطار الاول 50 كم/س واسرعت القطار الثاني 70كم/س تكون السرعة النسبية للقطار الاول كما يقدرها ركاب القطار الثاني........   كيلو متر/الساعة",
                "50",
                "20",
                "70",
                "120",
                "120"
        );Question q15 = new Question(
                " تمنع....... انزلاق الأقدام عند السير",
                "القوي الكهرومغناطيسية",
                "قوي الاحتكاك",
                "القوي داخل الأنظمة الحية",
                "قوي القصور الذاتي",
                "قوي الاحتكاك"
        );Question q16 = new Question(
                " كل ما يأتي يعتبر صحيحا بالنسبة ل موجات الصوت عدا",
                "سرعتها اقل من سرعه موجات الأشعة تحت الحمراء",
                "يمكنها الانتشار في الفراغ",
                "تنشا من اهتزاز الاجسام المحدثة لها",
                "تعتبر من الموجات الميكانيكية",
                "يمكنها الانتشار في الفراغ"
        );Question q17 = new Question(
                " ماذا يحدث عند عدم ارتداء السائق حزام الأمان. ",
                "يندفع السائق للأمام عند التوقف المفاجئ بفعل الجاذبية الأرضية ",
                "يندفع السائق للخلف عند التوقف المفاجئ بفعل الجاذبية الأرضية ",
                "يندفع السائق للأمام عند التوقف المفاجئ بفعل قوي القصور الذاتي ",
                "يندفع السائق للخلف عند التوقف المفاجئ بفعل قوي القصور الذاتي ",
                "يندفع السائق للأمام عند التوقف المفاجئ بفعل قوي القصور الذاتي "
        );Question q18 = new Question(
                "سرعه موجات الإذاعة في الفراغ........ سرعه موجات الضوء",
                "ضعف",
                "أقل من",
                "تساوي",
                "أكبر من",
                "تساوي"
        );
        Question q19 = createTorF(" لابد ان يكون الجسم المتحرك واقعا تحت تأثير قوه",
                "صح");
        Question q20 = new Question(
                "إذا تحركت سيارتان في نفس الاتجاه وبسرعة 100 كيلو متر على الساعة فان سرعه السيارة الثانية كما يقدرها سائق السيارة الاولى ",
                "صفر ",
                "180 كم / س",
                "50 كم / س",
                "100 كم / س",
                "صفر "
        );
        Question q21 = createTorF(
                "وزن الجسم عند القطب الشمالي اقل من وزنه عند خط الاستواء",
                "خطأ");
        Question q22 = createTorF(
                "تزداد قيمه عجله الجاذبية الأرضية كلما اقتربنا من مركز الارض",
                "صح"
        );

        Question q23 = new Question(
                ". إذا كانت كتله الجسم عند القطب الشمال 50 كجم فأن كتلته عند خط الاستواء تساوى......",
                "1000 كجم",
                " 50 كجم",
                "500 كجم",
                "400 كجم",
                " 50 كجم"
        );

        Question q24 = new Question(
                "سيارة تتحرك بسرعه ٤٠ كم/ساعة في عكس اتجاه سيارة تتحرك بسرعه ١٠٠ كم/ساعة تكون سرعتها النسبية.....  ",
                "صفر ",
                "60 كم / س",
                "40 كم / س",
                "140 كم / س ",
                "140 كم / س "
        );

        Question q25 = new Question(
                " من اضرار قوي الاحتكاك فقط جزء من الطاقة............ وتحويله الي طاقة.",
                "حرارية، كهربيه",
                "كهربيه، ميكانيكيه",
                "ميكانيكيه، حرارية",
                "حرارية، صوتيه",
                "ميكانيكيه، حرارية"
        );
        Question q26 = new Question(
                "تستخدم في تعقيم غرفه العمليات الجراحية.",
                "اشعه جاما ",
                "اشعه فوق البنفسجية ",
                "الأشعة تحت الحمراء ",
                "الأشعة السينية ",
                "اشعه فوق البنفسجية "
        );

        Question q27 = new Question(
                " عندما تركب في قطار سرعته 120 كم / س تري الأشجار تتحرك بسرعه.........",
                "120 كم / س في عكس اتجاه القطار",
                "120 كم / س في نفس اتجاه القطار",
                "140 كم / س في عكس اتجاه القطار",
                "140 كم / س في نفس اتجاه القطار",
                "120 كم / س في عكس اتجاه القطار"
        );

        Question q28 = new Question(
                " ينتقل الماء الي التربة تأثير قوي..........",
                "الاحتكاك",
                "القصور الذاتي",
                "الجاذبية",
                "الحيوية",
                "الحيوية"
        );

        Question q29 = new Question(
                " خاصيه مقاومه الجسم المادي لتغيير حالته من السكون الي الحركة او العكس",
                "الاحتكاك",
                "القصور الذاتي",
                "العجلة",
                "السرعة النسبية",
                "القصور الذاتي"
        );
        Question q30 = new Question(
                " الشيء المشترك بين موجات الصوت موجات الإذاعة؟",
                "كلاهما موجات كهرومغناطيسية",
                "كلاهما موجات موجيه",
                "كلاهما ينتشر في الفراغ",
                "كلاهما موجات مستعرضه ",
                "كلاهما موجات موجيه"
        );



    }

    private Question createTorF(String head, String ans){
        return new Question(head, "صح", "خطأ", "", "", ans);
    }
}